org/elisp_learn.org
* Emacs Lisp 简明教程
  该教程是[[http://smacs.github.io/elisp/][叶文彬写的 Emacs Lisp 的教程]]，在这里记录学习笔记。
** 基础知识
*** 函数与变量
    elisp 定义一个函数形式如下：
    #+BEGIN_SRC elisp
    (defun function-name (arguments-list)
    "document string"
    body)
    #+END_SRC
    example:
    #+BEGIN_SRC elisp
    (defun hello-word (name)
    "Say hello to user whose name is Name."
    (message "Hello, %s" name))
    (hello-word "Bluesands")
    #+END_SRC

    #+RESULTS:
    : Hello, Bluesands

    可以使用 C-h f 输入函数名查看函数帮助。
    每个函数都有一个返回值，这个返回值一般是函数定义里的最后一个表达式的值。

    elisp 里的变量使用无需像 c 语言那样需要声明，你可以使用 setq 直接对一个变量赋值。
    #+BEGIN_SRC elisp
    (setq foo "I'm foo")
    (message foo)
    #+END_SRC

    #+RESULTS:
    : I’m foo

    可以使用 C-h v 输入变量名查看变量文档

    有一个特殊的表达式(special form) defvar，它可以声明一个变量，一般形式是：
    #+BEGIN_SRC elisp
    (defvar variable-name value
    "document string")
    #+END_SRC
    它与 setq 的区别是，如果变量在声明之前已经有一个值的话，用 defvar 声明的变量不会改变成声明的值。另一个区别是 defvar 可以为变量提供文档字符串。
    #+BEGIN_SRC elisp
    (defvar foo "Did I have a value?"
    "A demo variable")
    foo
    #+END_SRC

    #+RESULTS:
    : Did I have a value?
    
    由于 elisp 中函数是全局的，变量也很容易成为全局变量（因为全局变量和局部变量的赋值都是使用 setq 函数），名字不互为冲突是很关键的。所以除了为你的函数和变量选择一个合适的前缀之外，用 C-h f 和 C-h v 查看一下函数名和变量名有没有被使用过是很关键的。
*** 局部作用域的变量
   如果没有局部作用域的变量，都使用全局变量，函数会相当难写，elisp 使用 let 和 let*进行局部变量绑定。 
   #+BEGIN_SRC elisp
   (let (bindings)
   body)
   #+END_SRC
   bindings 可以是(var value)这样对 var 赋初始值，或则使用 var 声明一个初始值为 nil 的变量。
   #+BEGIN_SRC elisp
   (defun circls-area (radix)
   (let ((pi 3.1415929)
   area)
   (setq area (* pi radix radix))
   (message "直径%.2f 的圆面积是%.2f" radix area)))
   (circls-area 3)
   #+END_SRC

   #+RESULTS:
   : 直径 3.00 的圆面积是 28.27
   
   let*和 let 的形式完全相同，区别是 let*声明中可以是使用前面声明过的变量：
   #+begin_src emacs-lisp :tangle yes
   (defun circls-area (radix)
   (let* ((pi 3.1415926)
   (area (* pi radix radix)))
   (message "直径%.2f 的圆面积是%.2f" radix area)))
   (circls-area 3)
   #+end_src

   #+RESULTS:
   : 直径 3.00 的圆面积是 28.27
*** lambda 表达式
    可能你久闻 lambda 表达式的大名了，其实 lambda 表达式相当与其他语言的匿名函数：
    #+BEGIN_SRC emacs-lisp
    (lambda (arguments-list)
    "documentation string"
    body)
    #+END_SRC
    lambda 使用实例：
    #+BEGIN_SRC emacs-lisp
    (funcall (lambda (name)
    (message "Hello, %s!" name)) "Emacser")
    #+END_SRC

    #+RESULTS:
    : Hello, Emacser!
    或者将 lambda 表达式赋值给一个变量，然后 funcall 调用：
    #+BEGIN_SRC emacs-lisp
    (setq foo (lambda (name)
    (message "Hello, %s!" name)))
    (funcall foo "Emacser")
    #+END_SRC

    #+RESULTS:
    : Hello, Emacser!
    lambda 表达式最常用的作用是作为参数传递给其他函数，比如 mapc。

