elisp_learn.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2017-12-12 二 11:44 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org mode" />
<link rel="stylesheet" title="Standard" href="/worg/style/worg.css" type="text/css" /> <link rel="alternate stylesheet" title="Zenburn" href="/worg/style/worg-zenburn.css" type="text/css" /> <link rel="alternate stylesheet" title="Classic" href="/worg/style/worg-classic.css" type="text/css" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="index.html"> UP </a>
 |
 <a accesskey="H" href="index.html"> HOME </a>
</div><div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org4e1737f">Emacs Lisp 简明教程</a>
<ul>
<li><a href="#orgb9f6b33">基础知识</a>
<ul>
<li><a href="#org3c2da8e">函数与变量</a></li>
<li><a href="#orged83e28">局部作用域的变量</a></li>
<li><a href="#orgcf40471">lambda 表达式</a></li>
<li><a href="#orgdaebf1a">控制结构</a></li>
</ul>
</li>
<li><a href="#orgc7e0682">基本数据类型</a>
<ul>
<li><a href="#org6014573">数字</a></li>
<li><a href="#org5244081">字符和字符串</a></li>
<li><a href="#org34462e8">cons cell 和列表</a></li>
<li><a href="#orgf995c44">数组和序列</a></li>
<li><a href="#org4bf2365">符号</a></li>
</ul>
</li>
<li><a href="#org51b604b">求值规则</a></li>
<li><a href="#orge8da8e3">变量</a></li>
<li><a href="#org97fe0ac">函数和命令</a></li>
<li><a href="#orge274feb">正则表达式</a></li>
<li><a href="#orge9fb1cd">操作对象</a>
<ul>
<li><a href="#orgbaf56eb">缓冲区</a></li>
<li><a href="#org61d8915">窗口</a></li>
<li><a href="#orgd05c605">文件</a></li>
<li><a href="#orgf62a80d">文本</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-org4e1737f" class="outline-2">
<h2 id="org4e1737f">Emacs Lisp 简明教程</h2>
<div class="outline-text-2" id="text-org4e1737f">
<p>
该教程是<a href="http://smacs.github.io/elisp/">叶文彬写的 Emacs Lisp 的教程</a>，在这里记录学习笔记。
</p>
</div>
<div id="outline-container-orgb9f6b33" class="outline-3">
<h3 id="orgb9f6b33">基础知识</h3>
<div class="outline-text-3" id="text-orgb9f6b33">
</div>
<div id="outline-container-org3c2da8e" class="outline-4">
<h4 id="org3c2da8e">函数与变量</h4>
<div class="outline-text-4" id="text-org3c2da8e">
<p>
elisp 定义一个函数形式如下：
</p>
<div class="org-src-container">
<pre class="src src-elisp"><span style="color: #4f97d7;">(</span><span style="color: #4f97d7; font-weight: bold;">defun</span> <span style="color: #bc6ec5; font-weight: bold;">function-name</span> <span style="color: #bc6ec5;">(</span>arguments-list<span style="color: #bc6ec5;">)</span>
<span style="color: #2aa1ae;">"document string"</span>
body<span style="color: #4f97d7;">)</span>
</pre>
</div>
<p>
example:
</p>
<div class="org-src-container">
<pre class="src src-elisp"><span style="color: #4f97d7;">(</span><span style="color: #4f97d7; font-weight: bold;">defun</span> <span style="color: #bc6ec5; font-weight: bold;">hello-word</span> <span style="color: #bc6ec5;">(</span>name<span style="color: #bc6ec5;">)</span>
<span style="color: #2aa1ae;">"Say hello to user whose name is Name."</span>
<span style="color: #bc6ec5;">(</span>message <span style="color: #2d9574;">"Hello, %s"</span> name<span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span>
<span style="color: #4f97d7;">(</span>hello-word <span style="color: #2d9574;">"Bluesands"</span><span style="color: #4f97d7;">)</span>
</pre>
</div>

<p>
可以使用 C-h f 输入函数名查看函数帮助。每个函数都有一个返回值，这个返回值一般是函数定义里的最后一个表达式的值。
</p>

<p>
elisp 里的变量使用无需像 c 语言那样需要声明，你可以使用 setq 直接对一个变量赋值。
</p>
<div class="org-src-container">
<pre class="src src-elisp"><span style="color: #4f97d7;">(</span><span style="color: #4f97d7; font-weight: bold;">setq</span> foo <span style="color: #2d9574;">"I'm foo"</span><span style="color: #4f97d7;">)</span>
<span style="color: #4f97d7;">(</span>message foo<span style="color: #4f97d7;">)</span>
</pre>
</div>

<p>
可以使用 C-h v 输入变量名查看变量文档
</p>

<p>
有一个特殊的表达式(special form) defvar，它可以声明一个变量，一般形式是：
</p>
<div class="org-src-container">
<pre class="src src-elisp"><span style="color: #4f97d7;">(</span><span style="color: #4f97d7; font-weight: bold;">defvar</span> <span style="color: #7590db;">variable-name</span> value
<span style="color: #2aa1ae;">"document string"</span><span style="color: #4f97d7;">)</span>
</pre>
</div>
<p>
它与 setq 的区别是，如果变量在声明之前已经有一个值的话，用 defvar 声明的变量不会改变成声明的值。另一个区别是 defvar 可以为变量提供文档字符串。
</p>
<div class="org-src-container">
<pre class="src src-elisp"><span style="color: #4f97d7;">(</span><span style="color: #4f97d7; font-weight: bold;">defvar</span> <span style="color: #7590db;">foo</span> <span style="color: #2d9574;">"Did I have a value?"</span>
<span style="color: #2aa1ae;">"A demo variable"</span><span style="color: #4f97d7;">)</span>
foo
</pre>
</div>

<p>
由于 elisp 中函数是全局的，变量也很容易成为全局变量（因为全局变量和局部变量的赋值都是使用 setq 函数），名字不互为冲突是很关键的。所以除了为你的函数和变量选择一个合适的前缀之外，用 C-h f 和 C-h v 查看一下函数名和变量名有没有被使用过是很关键的。
</p>
</div>
</div>
<div id="outline-container-orged83e28" class="outline-4">
<h4 id="orged83e28">局部作用域的变量</h4>
<div class="outline-text-4" id="text-orged83e28">
<p>
如果没有局部作用域的变量，都使用全局变量，函数会相当难写，elisp 使用 let 和 let*进行局部变量绑定。 
</p>
<div class="org-src-container">
<pre class="src src-elisp"><span style="color: #4f97d7;">(</span><span style="color: #4f97d7; font-weight: bold;">let</span> <span style="color: #bc6ec5;">(</span>bindings<span style="color: #bc6ec5;">)</span>
body<span style="color: #4f97d7;">)</span>
</pre>
</div>
<p>
bindings 可以是(var value)这样对 var 赋初始值，或则使用 var 声明一个初始值为 nil 的变量。
</p>
<div class="org-src-container">
<pre class="src src-elisp"><span style="color: #4f97d7;">(</span><span style="color: #4f97d7; font-weight: bold;">defun</span> <span style="color: #bc6ec5; font-weight: bold;">circls-area</span> <span style="color: #bc6ec5;">(</span>radix<span style="color: #bc6ec5;">)</span>
<span style="color: #bc6ec5;">(</span><span style="color: #4f97d7; font-weight: bold;">let</span> <span style="color: #2d9574;">(</span><span style="color: #67b11d;">(</span>pi <span style="color: #a45bad;">3.1415929</span><span style="color: #67b11d;">)</span>
area<span style="color: #2d9574;">)</span>
<span style="color: #2d9574;">(</span><span style="color: #4f97d7; font-weight: bold;">setq</span> area <span style="color: #67b11d;">(</span>* pi radix radix<span style="color: #67b11d;">)</span><span style="color: #2d9574;">)</span>
<span style="color: #2d9574;">(</span>message <span style="color: #2d9574;">"&#30452;&#24452;%.2f &#30340;&#22278;&#38754;&#31215;&#26159;%.2f"</span> radix area<span style="color: #2d9574;">)</span><span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span>
<span style="color: #4f97d7;">(</span>circls-area <span style="color: #a45bad;">3</span><span style="color: #4f97d7;">)</span>
</pre>
</div>

<p>
let*和 let 的形式完全相同，区别是 let*声明中可以是使用前面声明过的变量：
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4f97d7;">(</span><span style="color: #4f97d7; font-weight: bold;">defun</span> <span style="color: #bc6ec5; font-weight: bold;">circls-area</span> <span style="color: #bc6ec5;">(</span>radix<span style="color: #bc6ec5;">)</span>
<span style="color: #bc6ec5;">(</span><span style="color: #4f97d7; font-weight: bold;">let*</span> <span style="color: #2d9574;">(</span><span style="color: #67b11d;">(</span>pi <span style="color: #a45bad;">3.1415926</span><span style="color: #67b11d;">)</span>
<span style="color: #67b11d;">(</span>area <span style="color: #b1951d;">(</span>* pi radix radix<span style="color: #b1951d;">)</span><span style="color: #67b11d;">)</span><span style="color: #2d9574;">)</span>
<span style="color: #2d9574;">(</span>message <span style="color: #2d9574;">"&#30452;&#24452;%.2f &#30340;&#22278;&#38754;&#31215;&#26159;%.2f"</span> radix area<span style="color: #2d9574;">)</span><span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span>
<span style="color: #4f97d7;">(</span>circls-area <span style="color: #a45bad;">3</span><span style="color: #4f97d7;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgcf40471" class="outline-4">
<h4 id="orgcf40471">lambda 表达式</h4>
<div class="outline-text-4" id="text-orgcf40471">
<p>
可能你久闻 lambda 表达式的大名了，其实 lambda 表达式相当与其他语言的匿名函数：
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4f97d7;">(</span><span style="color: #4f97d7; font-weight: bold;">lambda</span> <span style="color: #bc6ec5;">(</span>arguments-list<span style="color: #bc6ec5;">)</span>
<span style="color: #2aa1ae;">"documentation string"</span>
body<span style="color: #4f97d7;">)</span>
</pre>
</div>
<p>
lambda 使用实例：
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4f97d7;">(</span>funcall <span style="color: #bc6ec5;">(</span><span style="color: #4f97d7; font-weight: bold;">lambda</span> <span style="color: #2d9574;">(</span>name<span style="color: #2d9574;">)</span>
<span style="color: #2d9574;">(</span>message <span style="color: #2d9574;">"Hello, %s!"</span> name<span style="color: #2d9574;">)</span><span style="color: #bc6ec5;">)</span> <span style="color: #2d9574;">"Emacser"</span><span style="color: #4f97d7;">)</span>
</pre>
</div>
<p>
或者将 lambda 表达式赋值给一个变量，然后 funcall 调用：
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4f97d7;">(</span><span style="color: #4f97d7; font-weight: bold;">setq</span> foo <span style="color: #bc6ec5;">(</span><span style="color: #4f97d7; font-weight: bold;">lambda</span> <span style="color: #2d9574;">(</span>name<span style="color: #2d9574;">)</span>
<span style="color: #2d9574;">(</span>message <span style="color: #2d9574;">"Hello, %s!"</span> name<span style="color: #2d9574;">)</span><span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span>
<span style="color: #4f97d7;">(</span>funcall foo <span style="color: #2d9574;">"Emacser"</span><span style="color: #4f97d7;">)</span>
</pre>
</div>
<p>
lambda 表达式最常用的作用是作为参数传递给其他函数，比如 mapc。
</p>
</div>
</div>
