org/elisp_learn.org
*** 控制结构
    顺序执行
    一般来说程序都是按表达式顺序依次执行的，这在 defun 特殊环境中是自动执行的。但是一般情况下都不是这样的，比如你无法用 eval-last-sexp 同时执行两个表达式，在 if 表达式中的条件为真执行的部分也只能运行一个表达式。这时就需要用 progn 这个特殊的表达式，它的使用形式如下：
    #+BEGIN_SRC emacs-lisp
    (progn A B C ...)
    #+END_SRC
    它的作用就是让表达式 A,B,C 顺序执行。比如：
    #+BEGIN_SRC emacs-lisp
    (progn
    (setq foo 3)
    (message "Square of %d is %d" foo (* foo foo)))
    #+END_SRC

    #+RESULTS:
    : Square of 3 is 9
    
    条件判断
    elisp 有连个最基本的条件判断表达式 if 和 cond。使用形式分别如下：
    #+BEGIN_SRC emacs-lisp
    (if condition
    then
    else)
    (cond (case1 do-when-case1)
    (case2 do-when-case2)
    ...
    (t do-when-none-meet))
    #+END_SRC
    使用实例如下：
    #+BEGIN_SRC emacs-lisp
          (defun my-max (a b)
            (if (> a b)
                a b))
          (my-max 3 4)

      (defun fib (n)
        (cond ((= n 0) 0)
              ((= n 1) 1)
              (t (+ (fib (- n 1))
                    (fib (- n 2))))))
      (fib 10)
    #+END_SRC

    #+RESULTS:
    : 55
    还有两个宏 when 和 unless，从它们的名字就知道它们是什么用的。使用这两个宏的好处是使代码可读性提高，when 能省去 if 里的 progn 结构，unless 省去条件为真子句需要的 nil 表达式。
    
    循环
    使用循环 while 表达式：
    #+BEGIN_SRC emacs-lisp
      (while condition
        body)
    #+END_SRC
    实例：
    #+BEGIN_SRC emacs-lisp
      (defun factorial (n)
        (let ((res 1))
          (while (> n 1)
            (setq res (* res n)
                  n (- n 1)))
          res))
      (factorial 10)
    #+END_SRC

    #+RESULTS:
    : 3628800

逻辑运算
条件的逻辑运算和其他语言都是很类似的，使用 and、or、not。and 和 or 同样具有短路性质。很多人喜欢在表达式短时，用 and 代替 when，or 代替 unless。当然这时一般不关心它们的返回值，而是在于表达式其它子句的副作用。比如 or 经常用于设置函数的缺省值，而 and 常用与参数检查：
#+BEGIN_SRC emacs-lisp :export results output append
  (defun hello-world (&optional name)
    (or name (setq name "Emacser"))
    (message "Hello, %s" name))

  (hello-world)
  (hello-world "Ye")
#+END_SRC

#+RESULTS:
: Hello, Ye

** 基本数据类型
*** 数字
    emacs 的数字分为整数和浮点数（没有 c 的双精度数 double），其中 integer 可以使用 most-positive-fixnum 和 most-negative-fixnum 两个变量得到范围；float 可以使用 most-positive-float 和 most-negative-float 得到范围。
    #+BEGIN_SRC emacs-lisp :results output
      (princ (format "This machine integer max is %d and min is %d.\n" most-positive-fixnum most-negative-fixnum))
      (princ (format "This machine float max is %s and min is %s." most-positive-float most-negative-float))
    #+END_SRC

    #+RESULTS:
    : This machine integer max is 2305843009213693951 and min is -2305843009213693952.
    : This machine float max is nil and min is nil.
    
    测试函数
    整数类型测试函数是 integerp，浮点数类型测试函数是 floatp。数字类型测试用 numberp。你可以分别运行这几个例子来试验一下：
    #+BEGIN_SRC emacs-lisp :results output :exports results
      (princ (integerp 1.))
      (print (integerp 1.0))
      (princ (floatp 1.))
      (print (floatp -0.0e+NaN))
      (princ (numberp 1))
    #+END_SRC

    #+RESULTS:
    : t
    : nil
    : nil
    : t
    : t
    还提供一些特殊测试，比如测试零的 zerop，还有非负整数测试的 wholenump。
    elisp 测试函数一般都是用 p 结尾，p 是 predicate 的第一个字母，如果函数名是一个单词，通常只是在这个单词后加一个 p，如果是多个单词，一般是加-p。
