elisp_learn.html

<div id="outline-container-orgdaebf1a" class="outline-4">
<h4 id="orgdaebf1a">控制结构</h4>
<div class="outline-text-4" id="text-orgdaebf1a">
<p>
顺序执行一般来说程序都是按表达式顺序依次执行的，这在 defun 特殊环境中是自动执行的。但是一般情况下都不是这样的，比如你无法用 eval-last-sexp 同时执行两个表达式，在 if 表达式中的条件为真执行的部分也只能运行一个表达式。这时就需要用 progn 这个特殊的表达式，它的使用形式如下：
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4f97d7;">(</span><span style="color: #4f97d7; font-weight: bold;">progn</span> A B C ...<span style="color: #4f97d7;">)</span>
</pre>
</div>
<p>
它的作用就是让表达式 A,B,C 顺序执行。比如：
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4f97d7;">(</span><span style="color: #4f97d7; font-weight: bold;">progn</span>
<span style="color: #bc6ec5;">(</span><span style="color: #4f97d7; font-weight: bold;">setq</span> foo <span style="color: #a45bad;">3</span><span style="color: #bc6ec5;">)</span>
<span style="color: #bc6ec5;">(</span>message <span style="color: #2d9574;">"Square of %d is %d"</span> foo <span style="color: #2d9574;">(</span>* foo foo<span style="color: #2d9574;">)</span><span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span>
</pre>
</div>

<p>
条件判断
elisp 有连个最基本的条件判断表达式 if 和 cond。使用形式分别如下：
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4f97d7;">(</span><span style="color: #4f97d7; font-weight: bold;">if</span> condition
then
else<span style="color: #4f97d7;">)</span>
<span style="color: #4f97d7;">(</span><span style="color: #4f97d7; font-weight: bold;">cond</span> <span style="color: #bc6ec5;">(</span>case1 do-when-case1<span style="color: #bc6ec5;">)</span>
<span style="color: #bc6ec5;">(</span>case2 do-when-case2<span style="color: #bc6ec5;">)</span>
...
<span style="color: #bc6ec5;">(</span>t do-when-none-meet<span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span>
</pre>
</div>
<p>
使用实例如下：
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">    <span style="color: #4f97d7;">(</span><span style="color: #4f97d7; font-weight: bold;">defun</span> <span style="color: #bc6ec5; font-weight: bold;">my-max</span> <span style="color: #bc6ec5;">(</span>a b<span style="color: #bc6ec5;">)</span>
      <span style="color: #bc6ec5;">(</span><span style="color: #4f97d7; font-weight: bold;">if</span> <span style="color: #2d9574;">(</span>&gt; a b<span style="color: #2d9574;">)</span>
          a b<span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span>
    <span style="color: #4f97d7;">(</span>my-max <span style="color: #a45bad;">3</span> <span style="color: #a45bad;">4</span><span style="color: #4f97d7;">)</span>

<span style="color: #4f97d7;">(</span><span style="color: #4f97d7; font-weight: bold;">defun</span> <span style="color: #bc6ec5; font-weight: bold;">fib</span> <span style="color: #bc6ec5;">(</span>n<span style="color: #bc6ec5;">)</span>
  <span style="color: #bc6ec5;">(</span><span style="color: #4f97d7; font-weight: bold;">cond</span> <span style="color: #2d9574;">(</span><span style="color: #67b11d;">(</span>= n <span style="color: #a45bad;">0</span><span style="color: #67b11d;">)</span> <span style="color: #a45bad;">0</span><span style="color: #2d9574;">)</span>
        <span style="color: #2d9574;">(</span><span style="color: #67b11d;">(</span>= n <span style="color: #a45bad;">1</span><span style="color: #67b11d;">)</span> <span style="color: #a45bad;">1</span><span style="color: #2d9574;">)</span>
        <span style="color: #2d9574;">(</span>t <span style="color: #67b11d;">(</span>+ <span style="color: #b1951d;">(</span>fib <span style="color: #4f97d7;">(</span>- n <span style="color: #a45bad;">1</span><span style="color: #4f97d7;">)</span><span style="color: #b1951d;">)</span>
              <span style="color: #b1951d;">(</span>fib <span style="color: #4f97d7;">(</span>- n <span style="color: #a45bad;">2</span><span style="color: #4f97d7;">)</span><span style="color: #b1951d;">)</span><span style="color: #67b11d;">)</span><span style="color: #2d9574;">)</span><span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span>
<span style="color: #4f97d7;">(</span>prin1 <span style="color: #bc6ec5;">(</span>fib <span style="color: #a45bad;">10</span><span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span>
</pre>
</div>

<pre class="example">
55

</pre>
<p>
还有两个宏 when 和 unless，从它们的名字就知道它们是什么用的。使用这两个宏的好处是使代码可读性提高，when 能省去 if 里的 progn 结构，unless 省去条件为真子句需要的 nil 表达式。
</p>

<p>
循环使用循环 while 表达式：
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4f97d7;">(</span><span style="color: #4f97d7; font-weight: bold;">while</span> condition
  body<span style="color: #4f97d7;">)</span>
</pre>
</div>
<p>
实例：
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4f97d7;">(</span><span style="color: #4f97d7; font-weight: bold;">defun</span> <span style="color: #bc6ec5; font-weight: bold;">factorial</span> <span style="color: #bc6ec5;">(</span>n<span style="color: #bc6ec5;">)</span>
  <span style="color: #bc6ec5;">(</span><span style="color: #4f97d7; font-weight: bold;">let</span> <span style="color: #2d9574;">(</span><span style="color: #67b11d;">(</span>res <span style="color: #a45bad;">1</span><span style="color: #67b11d;">)</span><span style="color: #2d9574;">)</span>
    <span style="color: #2d9574;">(</span><span style="color: #4f97d7; font-weight: bold;">while</span> <span style="color: #67b11d;">(</span>&gt; n <span style="color: #a45bad;">1</span><span style="color: #67b11d;">)</span>
      <span style="color: #67b11d;">(</span><span style="color: #4f97d7; font-weight: bold;">setq</span> res <span style="color: #b1951d;">(</span>* res n<span style="color: #b1951d;">)</span>
            n <span style="color: #b1951d;">(</span>- n <span style="color: #a45bad;">1</span><span style="color: #b1951d;">)</span><span style="color: #67b11d;">)</span><span style="color: #2d9574;">)</span>
    res<span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span>
<span style="color: #4f97d7;">(</span>prin1 <span style="color: #bc6ec5;">(</span>factorial <span style="color: #a45bad;">10</span><span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span>
</pre>
</div>

<pre class="example">
3628800

</pre>

<p>
逻辑运算条件的逻辑运算和其他语言都是很类似的，使用 and、or、not。and 和 or 同样具有短路性质。很多人喜欢在表达式短时，用 and 代替 when，or 代替 unless。当然这时一般不关心它们的返回值，而是在于表达式其它子句的副作用。比如 or 经常用于设置函数的缺省值，而 and 常用与参数检查：
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4f97d7;">(</span><span style="color: #4f97d7; font-weight: bold;">defun</span> <span style="color: #bc6ec5; font-weight: bold;">hello-world</span> <span style="color: #bc6ec5;">(</span><span style="color: #ce537a; font-weight: bold;">&amp;optional</span> name<span style="color: #bc6ec5;">)</span>
  <span style="color: #bc6ec5;">(</span><span style="color: #4f97d7; font-weight: bold;">or</span> name <span style="color: #2d9574;">(</span><span style="color: #4f97d7; font-weight: bold;">setq</span> name <span style="color: #2d9574;">"Emacser"</span><span style="color: #2d9574;">)</span><span style="color: #bc6ec5;">)</span>
  <span style="color: #bc6ec5;">(</span>message <span style="color: #2d9574;">"Hello, %s"</span> name<span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span>

<span style="color: #4f97d7;">(</span>prin1 <span style="color: #bc6ec5;">(</span>hello-world<span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span>
<span style="color: #4f97d7;">(</span>print <span style="color: #bc6ec5;">(</span>hello-world <span style="color: #2d9574;">"Ye"</span><span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span>
</pre>
</div>

<pre class="example">
"Hello, Emacser"
"Hello, Ye"

</pre>
</div>
</div>
</div>

<div id="outline-container-orgc7e0682" class="outline-3">
<h3 id="orgc7e0682">基本数据类型</h3>
<div class="outline-text-3" id="text-orgc7e0682">
</div>
<div id="outline-container-org6014573" class="outline-4">
<h4 id="org6014573">数字</h4>
<div class="outline-text-4" id="text-org6014573">
<p>
emacs 的数字分为整数和浮点数（没有 c 的双精度数 double），其中 integer 可以使用 most-positive-fixnum 和 most-negative-fixnum 两个变量得到范围；float 可以使用 most-positive-float 和 most-negative-float 得到范围。
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4f97d7;">(</span>princ <span style="color: #bc6ec5;">(</span>format <span style="color: #2d9574;">"This machine integer max is %d and min is %d.\n"</span> most-positive-fixnum most-negative-fixnum<span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span>
<span style="color: #4f97d7;">(</span>princ <span style="color: #bc6ec5;">(</span>format <span style="color: #2d9574;">"This machine float max is %s and min is %s."</span> most-positive-float most-negative-float<span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span>
</pre>
</div>

<pre class="example">
This machine integer max is 2305843009213693951 and min is -2305843009213693952.
This machine float max is nil and min is nil.

</pre>

<p>
测试函数整数类型测试函数是 integerp，浮点数类型测试函数是 floatp。数字类型测试用 numberp。你可以分别运行这几个例子来试验一下：
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4f97d7;">(</span>princ <span style="color: #bc6ec5;">(</span>integerp <span style="color: #a45bad;">1.</span><span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span>
<span style="color: #4f97d7;">(</span>print <span style="color: #bc6ec5;">(</span>integerp <span style="color: #a45bad;">1.0</span><span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span>
<span style="color: #4f97d7;">(</span>princ <span style="color: #bc6ec5;">(</span>floatp <span style="color: #a45bad;">1.</span><span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span>
<span style="color: #4f97d7;">(</span>print <span style="color: #bc6ec5;">(</span>floatp -0.0e+NaN<span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span>
<span style="color: #4f97d7;">(</span>princ <span style="color: #bc6ec5;">(</span>numberp <span style="color: #a45bad;">1</span><span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span>
</pre>
</div>

<pre class="example">
t
nil
nil
t
t

</pre>
<p>
还提供一些特殊测试，比如测试零的 zerop，还有非负整数测试的 wholenump。
elisp 测试函数一般都是用 p 结尾，p 是 predicate 的第一个字母，如果函数名是一个单词，通常只是在这个单词后加一个 p，如果是多个单词，一般是加-p。
</p>
</div>
</div>
