org/elisp_learn.org
*** 字符和字符串
    大小写转换使用的是 downcase 和 upcase 两个函数。这两个函数的参数既可以字符串，也可以是字符。capitalize 可以使字符串中单词的地一个字符大写，其他字符消协。upcase-initials 只使第一个单词的第一个字符大写，其他字符小写。这两个函数的参数如果是一个字符，那么只让这个字符大写。
    #+BEGIN_SRC emacs-lisp :results output
      (prin1 (downcase "The cat is the hat"))
      (print (downcase ?X))
      (prin1 (upcase "The cat in the hat"))
      (print (upcase ?X))
      (prin1 (capitalize "The CAT in tHe hat"))
      (print (upcase-initials "The CAT in the hAt"))
    #+END_SRC

    #+RESULTS:
    : "the cat is the hat"
    : 120
    : "THE CAT IN THE HAT"
    : 88
    : "The Cat In The Hat"
    : "The CAT In The HAt"
    
    格式化字符串
    format 类似与 c 语言里的 printf 可以实现对象的字符串化。数字的格式化和 printf 的参数差不多，值得一提的是"%s"这个格式化形式，它可以把对象的输出形式转化成字符串，这在调试时很有用。
    查找和替换
    字符串查找的核心函数是 string-match。这个函数可以从指定的位置对字符串进行正则表达式匹配，如果匹配成功，则返回匹配的起点：
    #+BEGIN_SRC emacs-lisp :results output
      (prin1 (string-match "34" "01234567890123456789"))
      (print (string-match "34" "01234567890123456789" 10))
    #+END_SRC

    #+RESULTS:
    : 3
    : 13
    注意 string-match 的采纳书是一个 regexp。emacs 好像没有内建的查找子串的函数。如果你想把 string-match 作为一个查找子串的函数，可以先用 regexp-quote 函数处理一下子串。
    #+BEGIN_SRC emacs-lisp :results output
      (prin1 (string-match "2*" "232*=696"))
      (print (string-match (regexp-quote "2*") "232*=696"))
    #+END_SRC

    #+RESULTS:
    : 0
    : 2
    
    string-match 在查找的同时，还会记录下每个要捕捉的字符串的位置。这个位置可以在匹配后用 match-data、match-beginning 和 match-end 等函数来获得。
    #+BEGIN_SRC emacs-lisp
      (progn
        (string-match "3\\(4\\)" "01234567890123456789")
        (match-data))
    #+END_SRC

    #+RESULTS:
    | 3 | 5 | 4 | 5 |

    #+BEGIN_SRC emacs-lisp :results output
      (let ((start 0))
        (while (string-match "34" "01234567890123456789" start)
          (princ (format "find at %d\n" (match-beginning 0)))
          (setq start (match-end 0))))
    #+END_SRC

    #+RESULTS:
    : find at 3
    : find at 13
    替换函数是 replace-match，可以用于字符串的替换，也可以用于缓冲区的文本替换，对于字符串的替换，replace-match 只是按给定的序号把字符串的那一部分用提供的字符串替换。
    #+BEGIN_SRC emacs-lisp :results output
      (let ((str "01234567890123456789"))
        (string-match "34" str)
        (prin1 (replace-match "x" nil nil str 0))
        (print str))
    #+END_SRC

    #+RESULTS:k
    : "012x567890123456789"
    : "01234567890123456789"

