elisp_learn.html
<div id="outline-container-org5244081" class="outline-4">
<h4 id="org5244081">字符和字符串</h4>
<div class="outline-text-4" id="text-org5244081">
<p>
大小写转换使用的是 downcase 和 upcase 两个函数。这两个函数的参数既可以字符串，也可以是字符。capitalize 可以使字符串中单词的地一个字符大写，其他字符消协。upcase-initials 只使第一个单词的第一个字符大写，其他字符小写。这两个函数的参数如果是一个字符，那么只让这个字符大写。
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4f97d7;">(</span>prin1 <span style="color: #bc6ec5;">(</span>downcase <span style="color: #2d9574;">"The cat is the hat"</span><span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span>
<span style="color: #4f97d7;">(</span>print <span style="color: #bc6ec5;">(</span>downcase ?X<span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span>
<span style="color: #4f97d7;">(</span>prin1 <span style="color: #bc6ec5;">(</span>upcase <span style="color: #2d9574;">"The cat in the hat"</span><span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span>
<span style="color: #4f97d7;">(</span>print <span style="color: #bc6ec5;">(</span>upcase ?X<span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span>
<span style="color: #4f97d7;">(</span>prin1 <span style="color: #bc6ec5;">(</span>capitalize <span style="color: #2d9574;">"The CAT in tHe hat"</span><span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span>
<span style="color: #4f97d7;">(</span>print <span style="color: #bc6ec5;">(</span>upcase-initials <span style="color: #2d9574;">"The CAT in the hAt"</span><span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span>
</pre>
</div>

<pre class="example">
"the cat is the hat"
120
"THE CAT IN THE HAT"
88
"The Cat In The Hat"
"The CAT In The HAt"

</pre>

<p>
格式化字符串
format 类似与 c 语言里的 printf 可以实现对象的字符串化。数字的格式化和 printf 的参数差不多，值得一提的是"%s"这个格式化形式，它可以把对象的输出形式转化成字符串，这在调试时很有用。查找和替换字符串查找的核心函数是 string-match。这个函数可以从指定的位置对字符串进行正则表达式匹配，如果匹配成功，则返回匹配的起点：
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4f97d7;">(</span>prin1 <span style="color: #bc6ec5;">(</span>string-match <span style="color: #2d9574;">"34"</span> <span style="color: #2d9574;">"01234567890123456789"</span><span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span>
<span style="color: #4f97d7;">(</span>print <span style="color: #bc6ec5;">(</span>string-match <span style="color: #2d9574;">"34"</span> <span style="color: #2d9574;">"01234567890123456789"</span> <span style="color: #a45bad;">10</span><span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span>
</pre>
</div>

<pre class="example">
3
13

</pre>
<p>
注意 string-match 的采纳书是一个 regexp。emacs 好像没有内建的查找子串的函数。如果你想把 string-match 作为一个查找子串的函数，可以先用 regexp-quote 函数处理一下子串。
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4f97d7;">(</span>prin1 <span style="color: #bc6ec5;">(</span>string-match <span style="color: #2d9574;">"2*"</span> <span style="color: #2d9574;">"232*=696"</span><span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span>
<span style="color: #4f97d7;">(</span>print <span style="color: #bc6ec5;">(</span>string-match <span style="color: #2d9574;">(</span>regexp-quote <span style="color: #2d9574;">"2*"</span><span style="color: #2d9574;">)</span> <span style="color: #2d9574;">"232*=696"</span><span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span>
</pre>
</div>

<pre class="example">
0
2

</pre>

<p>
string-match 在查找的同时，还会记录下每个要捕捉的字符串的位置。这个位置可以在匹配后用 match-data、match-beginning 和 match-end 等函数来获得。
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4f97d7;">(</span><span style="color: #4f97d7; font-weight: bold;">progn</span>
  <span style="color: #bc6ec5;">(</span>string-match <span style="color: #2d9574;">"3</span><span style="color: #2d9574; font-weight: bold;">\\</span><span style="color: #2d9574; font-weight: bold;">(</span><span style="color: #2d9574;">4</span><span style="color: #2d9574; font-weight: bold;">\\</span><span style="color: #2d9574; font-weight: bold;">)</span><span style="color: #2d9574;">"</span> <span style="color: #2d9574;">"01234567890123456789"</span><span style="color: #bc6ec5;">)</span>
  <span style="color: #bc6ec5;">(</span>match-data<span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4f97d7;">(</span><span style="color: #4f97d7; font-weight: bold;">let</span> <span style="color: #bc6ec5;">(</span><span style="color: #2d9574;">(</span>start <span style="color: #a45bad;">0</span><span style="color: #2d9574;">)</span><span style="color: #bc6ec5;">)</span>
  <span style="color: #bc6ec5;">(</span><span style="color: #4f97d7; font-weight: bold;">while</span> <span style="color: #2d9574;">(</span>string-match <span style="color: #2d9574;">"34"</span> <span style="color: #2d9574;">"01234567890123456789"</span> start<span style="color: #2d9574;">)</span>
    <span style="color: #2d9574;">(</span>princ <span style="color: #67b11d;">(</span>format <span style="color: #2d9574;">"find at %d\n"</span> <span style="color: #b1951d;">(</span>match-beginning <span style="color: #a45bad;">0</span><span style="color: #b1951d;">)</span><span style="color: #67b11d;">)</span><span style="color: #2d9574;">)</span>
    <span style="color: #2d9574;">(</span><span style="color: #4f97d7; font-weight: bold;">setq</span> start <span style="color: #67b11d;">(</span>match-end <span style="color: #a45bad;">0</span><span style="color: #67b11d;">)</span><span style="color: #2d9574;">)</span><span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span>
</pre>
</div>

<pre class="example">
find at 3
find at 13

</pre>
<p>
替换函数是 replace-match，可以用于字符串的替换，也可以用于缓冲区的文本替换，对于字符串的替换，replace-match 只是按给定的序号把字符串的那一部分用提供的字符串替换。
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4f97d7;">(</span><span style="color: #4f97d7; font-weight: bold;">let</span> <span style="color: #bc6ec5;">(</span><span style="color: #2d9574;">(</span>str <span style="color: #2d9574;">"01234567890123456789"</span><span style="color: #2d9574;">)</span><span style="color: #bc6ec5;">)</span>
  <span style="color: #bc6ec5;">(</span>string-match <span style="color: #2d9574;">"34"</span> str<span style="color: #bc6ec5;">)</span>
  <span style="color: #bc6ec5;">(</span>prin1 <span style="color: #2d9574;">(</span>replace-match <span style="color: #2d9574;">"x"</span> nil nil str <span style="color: #a45bad;">0</span><span style="color: #2d9574;">)</span><span style="color: #bc6ec5;">)</span>
  <span style="color: #bc6ec5;">(</span>print str<span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span>
</pre>
</div>

<pre class="example">
"012x567890123456789"
"01234567890123456789"

</pre>

<pre class="example">
"012x567890123456789"
"01234567890123456789"

</pre>
</div>
</div>
