elisp_learn.html

<div id="outline-container-org34462e8" class="outline-4">
<h4 id="org34462e8">cons cell 和列表</h4>
<div class="outline-text-4" id="text-org34462e8">
<p>
从概念上讲 cons cell 其实非常简单，就是两个有顺序的元素，第一个叫 CAR，第二个叫 CDR。CAR 和 CDR 名字来自与 Lisp。它最初在 IMB704 机器上的实现。在这种机器有一种取址模式，使人可以访问一个存储地址中的“地址（address）”部分和“减量（decrement）”部分。CAR 指令用与取出地址部分，表示（Contents of Address part of Register），CDR 指令用于取出地址的减量部分（Contents of the Decrement part of Register）。cons cell 也就是 construction of cell。car 函数用于取得 cons cell 的 CAR 部分，cdr 取出 cons cell 的 CDR 部分。cons cell 如此简单，但是它能衍生出许多高级的数据结构，比如链表，树，关联表等等。
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4f97d7;">(</span>prin1 '<span style="color: #bc6ec5;">(</span><span style="color: #a45bad;">1</span> . <span style="color: #a45bad;">2</span><span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span>
<span style="color: #4f97d7;">(</span>print '<span style="color: #bc6ec5;">(</span>?a . <span style="color: #a45bad;">1</span><span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span>
<span style="color: #4f97d7;">(</span>prin1 '<span style="color: #bc6ec5;">(</span><span style="color: #a45bad;">1</span> . <span style="color: #2d9574;">"a"</span><span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span>
<span style="color: #4f97d7;">(</span>print '<span style="color: #bc6ec5;">(</span><span style="color: #a45bad;">1</span> . nil<span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span>
<span style="color: #4f97d7;">(</span>prin1 '<span style="color: #bc6ec5;">(</span>nil . nil<span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span>
</pre>
</div>

<pre class="example">
(1 . 2)
(97 . 1)
(1 . "a")
(1)
(nil)

</pre>

<p>
注意到前面的表达式中都有一个'号，这是什么意思？其实理解了 eval-last-sexp 的作用就明白了。eval-last-sexp 其实包含了两个步骤，一是读入前一个 S-表达式，二是对读入的 S-表达式求值。这样如果读入一个 cons cell 的话，求值时会把这个 cons cell 的第一个元素作为一个函数来调用。而事实上，前面的这些例子的地一个元素都不是一个函数，这样就会产生一个错误 invalid-function。之所以前面没有遇到这个问题，那是因为前面数字和字符串是一类特殊的 S-表达式，它们求值后和求值前是不变，称为自求值表达式（self-evaluating-form）。'号其实是一个特殊的函数 quote，它的作用就是将它的参数返回而不是作求值。'(1 . 2)等价与(quote (1 . 2)).
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4f97d7;">(</span>prin1 '<span style="color: #bc6ec5;">(</span>+ <span style="color: #a45bad;">2</span> <span style="color: #a45bad;">3</span><span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span>
<span style="color: #4f97d7;">(</span>print <span style="color: #bc6ec5;">(</span><span style="color: #4f97d7; font-weight: bold;">quote</span> <span style="color: #2d9574;">(</span><span style="color: #a45bad;">1</span> . <span style="color: #a45bad;">2</span><span style="color: #2d9574;">)</span><span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span>
<span style="color: #4f97d7;">(</span>prin1 <span style="color: #bc6ec5;">(</span>+ <span style="color: #a45bad;">2</span> <span style="color: #a45bad;">3</span><span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span>
<span style="color: #4f97d7;">(</span>print <span style="color: #bc6ec5;">(</span>read <span style="color: #2d9574;">"(1 . 2)"</span><span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span>
</pre>
</div>

<pre class="example">
(+ 2 3)
(1 . 2)
5
(1 . 2)

</pre>
<p>
列表包括了 cons cell。但是列表中有一个特殊的元素-空表 nil。
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4f97d7;">(</span>prin1 nil<span style="color: #4f97d7;">)</span>
<span style="color: #4f97d7;">(</span>print '<span style="color: #bc6ec5;">()</span><span style="color: #4f97d7;">)</span>
</pre>
</div>

<pre class="example">
nil
nil

</pre>
<p>
空表不是一个 cons cell，因为它没有 CAR 和 CDR 两个部分，事实上空表里没有任何内容。但是为了编程的方便，可以认为 nil 的 CAR 和 CDR 都是 nil：
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4f97d7;">(</span>prin1 <span style="color: #bc6ec5;">(</span>car nil<span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span>
<span style="color: #4f97d7;">(</span>print <span style="color: #bc6ec5;">(</span>cdr nil<span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span>
</pre>
</div>

<pre class="example">
nil
nil

</pre>
<p>
按列表最后一个 cons cell 的 CDR 部分的类型分，可以把列表分为三类。如果是 nil，则称为“真列表”(true-list)。如果即不是 nil 也不是一个 cons cell，则这个列表称为“点列表”(dotted list)。还有一种可能，它指向列表中的一个 cons cell，则称为环形列表(circual list)。
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4f97d7;">(</span>prin1 '<span style="color: #bc6ec5;">(</span><span style="color: #a45bad;">1</span> <span style="color: #a45bad;">2</span> <span style="color: #a45bad;">3</span><span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span>
<span style="color: #4f97d7;">(</span>print '<span style="color: #bc6ec5;">(</span><span style="color: #a45bad;">1</span> <span style="color: #a45bad;">2</span> . <span style="color: #a45bad;">3</span><span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span>
<span style="color: #4f97d7;">(</span>prin1 '<span style="color: #bc6ec5;">(</span><span style="color: #a45bad;">1</span> . #1=<span style="color: #2d9574;">(</span><span style="color: #a45bad;">2</span> <span style="color: #a45bad;">3</span> . #<span style="color: #a45bad;">1</span>#<span style="color: #2d9574;">)</span><span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span>
</pre>
</div>

<pre class="example">
(1 2 3)
(1 2 . 3)
(1 2 3 . #1)

</pre>
<p>
从这个例子可以看出前两种列表的读入语法和输出形式都是相同的，而环形列表的读入语法是很古怪的，输出形式不能作为环形列表的读入形式。如果把真列表最后一个 cons cell 的 nil 省略不写，也就是(1 . nil)简写成(1)，把(obj1 . (obj2 . list)简写成(obj1 obj2 . list)，那么列表最后可以写成一个用括号括起来的元素列表：
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4f97d7;">(</span>prin1 '<span style="color: #bc6ec5;">(</span><span style="color: #a45bad;">1</span> . <span style="color: #2d9574;">(</span><span style="color: #a45bad;">2</span> . <span style="color: #67b11d;">(</span><span style="color: #a45bad;">3</span> . nil<span style="color: #67b11d;">)</span><span style="color: #2d9574;">)</span><span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span>
</pre>
</div>

<p>
测试函数测试一个对象是否是 cons cell 用 consp，是否是列表用 listp
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4f97d7;">(</span>prin1 <span style="color: #bc6ec5;">(</span>consp '<span style="color: #2d9574;">(</span><span style="color: #a45bad;">1</span> . <span style="color: #a45bad;">2</span><span style="color: #2d9574;">)</span><span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span>
<span style="color: #4f97d7;">(</span>print <span style="color: #bc6ec5;">(</span>consp '<span style="color: #2d9574;">(</span><span style="color: #a45bad;">1</span> . <span style="color: #67b11d;">(</span><span style="color: #a45bad;">2</span> . nil<span style="color: #67b11d;">)</span><span style="color: #2d9574;">)</span><span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span>
<span style="color: #4f97d7;">(</span>prin1 <span style="color: #bc6ec5;">(</span>consp nil<span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span>
<span style="color: #4f97d7;">(</span>print <span style="color: #bc6ec5;">(</span>listp '<span style="color: #2d9574;">(</span><span style="color: #a45bad;">1</span> . <span style="color: #a45bad;">2</span><span style="color: #2d9574;">)</span><span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span>
<span style="color: #4f97d7;">(</span>prin1 <span style="color: #bc6ec5;">(</span>listp '<span style="color: #2d9574;">(</span><span style="color: #a45bad;">1</span> . <span style="color: #67b11d;">(</span><span style="color: #a45bad;">2</span> . nil<span style="color: #67b11d;">)</span><span style="color: #2d9574;">)</span><span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span>
<span style="color: #4f97d7;">(</span>print <span style="color: #bc6ec5;">(</span>listp nil<span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span>
</pre>
</div>

<pre class="example">
t
t
nil
t
t
t

</pre>
<p>
没有内建的方法测试一个列表是不是一个真列表。通常如果一个函数需要一个真列表作为参数，都是在运行时发生错误，而不是进行参数检查，因为检查一个列表是真列表的代价比较高。测试一个对象是否是 nil 用 null 函数。只有当对象是空表时，null 才返回空值。构造函数生成一个 cons cell 可以用 cons 函数。比如：
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4f97d7;">(</span>prin1 <span style="color: #bc6ec5;">(</span>cons <span style="color: #a45bad;">1</span> <span style="color: #a45bad;">2</span><span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span>
<span style="color: #4f97d7;">(</span>print <span style="color: #bc6ec5;">(</span>cons <span style="color: #a45bad;">1</span> '<span style="color: #2d9574;">()</span><span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span>
</pre>
</div>

<pre class="example">
(1 . 2)
(1)

</pre>
<p>
也是在列表前面增加元素的方法。比如：
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4f97d7;">(</span>prin1 <span style="color: #bc6ec5;">(</span><span style="color: #4f97d7; font-weight: bold;">setq</span> foo '<span style="color: #2d9574;">(</span>a b<span style="color: #2d9574;">)</span><span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span>
<span style="color: #4f97d7;">(</span>print <span style="color: #bc6ec5;">(</span>cons 'x foo<span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span>
</pre>
</div>

<pre class="example">
(a b)
(x a b)

</pre>
<p>
值得注意的是前面这个例子的 foo 值并没有改变。事实上有一个宏 push 可以加入元素的同时改变列表的值：
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4f97d7;">(</span>prin1 <span style="color: #bc6ec5;">(</span><span style="color: #4f97d7; font-weight: bold;">push</span> 'x foo<span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span>
<span style="color: #4f97d7;">(</span>print foo<span style="color: #4f97d7;">)</span>
</pre>
</div>

<pre class="example">
(x a b)
(x a b)

</pre>
<p>
生成一个列表的函数是 list。比如：
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4f97d7;">(</span>prin1 <span style="color: #bc6ec5;">(</span>list <span style="color: #a45bad;">1</span> <span style="color: #a45bad;">2</span> <span style="color: #a45bad;">3</span><span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span>
</pre>
</div>

<pre class="example">
(1 2 3)

</pre>
<p>
quote（也就是'符号）和 cons 以及 list 的区别：quote 是把参数直接返回不进行求值，而 list 和 cons 是对参数求职后再生成一个列表或者 cons cell。例如：
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4f97d7;">(</span>prin1 '<span style="color: #bc6ec5;">(</span><span style="color: #2d9574;">(</span>+ <span style="color: #a45bad;">1</span> <span style="color: #a45bad;">2</span><span style="color: #2d9574;">)</span> <span style="color: #a45bad;">3</span><span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span>
<span style="color: #4f97d7;">(</span>print <span style="color: #bc6ec5;">(</span>list <span style="color: #2d9574;">(</span>+ <span style="color: #a45bad;">1</span> <span style="color: #a45bad;">2</span><span style="color: #2d9574;">)</span> <span style="color: #a45bad;">3</span><span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span>
</pre>
</div>

<pre class="example">
((+ 1 2) 3)
(3 3)

</pre>
<p>
前一个列表的 CAR 部分是（+ 1 2）这个列表，而后一个是先对（+ 1 2）求值得到 3 后在生成的列表。
</p>

<p>
前面提到在列表前端增加元素的方法是 cons，在列表后端增加元素的函数是用 append。比如：
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4f97d7;">(</span>prin1 <span style="color: #bc6ec5;">(</span>append '<span style="color: #2d9574;">(</span>a b<span style="color: #2d9574;">)</span> '<span style="color: #2d9574;">(</span>c<span style="color: #2d9574;">)</span><span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span>
</pre>
</div>

<pre class="example">
(a b c)

</pre>
<p>
append 的功能可以认为它把第一个参数最后一个列表的 nil 换成第二个参数，比如前面这个例子，第一个参数写成 cons cell 表示方法是(a . (b . nil))，把这个 nil 替换成(c)
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4f97d7;">(</span>prin1 <span style="color: #bc6ec5;">(</span>append '<span style="color: #2d9574;">(</span>a b<span style="color: #2d9574;">)</span> '<span style="color: #2d9574;">(</span>c<span style="color: #2d9574;">)</span> '<span style="color: #2d9574;">(</span>d<span style="color: #2d9574;">)</span><span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span>
</pre>
</div>

<pre class="example">
(a b c d)

</pre>
<p>
一般说来 append 的参数都要是列表，但是最后一个参数可以不是一个列表，这也不违背前面说的，因为 cons 的 CDR 部分本来就可以是任何对象：
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4f97d7;">(</span>prin1 <span style="color: #bc6ec5;">(</span>append '<span style="color: #2d9574;">(</span>a b<span style="color: #2d9574;">)</span> 'c<span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span>
</pre>
</div>

<pre class="example">
(a b . c)

</pre>
<p>
    这样得到的结果就不再是真列表，如果再使用 append 就会报错。如果写过 c 的链表类型，可能就知道如果链表只保留一个指针，那么链表只能在一端增加元素。elisp 的列表类型也是类似的，用
cons 在列表前增加元素比用 append 要快的多。
		append 的参数不限于列表，还可以是字符串或者向量。前面字符串里已经提到可以把一个字符串转换成字符列表，同样可能把响亮转换成一个列表：
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4f97d7;">(</span>prin1 <span style="color: #bc6ec5;">(</span>append <span style="color: #2d9574;">[</span>a b<span style="color: #2d9574;">]</span> <span style="color: #2d9574;">"cd"</span> nil<span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span>
<span style="color: #4f97d7;">(</span>print <span style="color: #bc6ec5;">(</span>append <span style="color: #2d9574;">[</span>a b<span style="color: #2d9574;">]</span> <span style="color: #2d9574;">"cd"</span><span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span>
</pre>
</div>

<pre class="example">
(a b 99 100)
(a b . "cd")

</pre>
<p>
注意前面最后一个参数 nil 是必要的，不然将得到点列表。
</p>

<p>
把列表当数组用要得到列表或者 cons cell 里元素，唯一的方法是用 car 和 cdr 函数。很容易明白，car 就是去得 cons cell 的 CAR 部分，cdr 函数就是取得 CDR 部分，通过这两个函数，我们就能访问 cons cell 和列表中的任何元素。
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4f97d7;">(</span><span style="color: #4f97d7; font-weight: bold;">defun</span> <span style="color: #bc6ec5; font-weight: bold;">get-list-element</span> <span style="color: #bc6ec5;">(</span>num tlist<span style="color: #bc6ec5;">)</span>
  <span style="color: #bc6ec5;">(</span><span style="color: #4f97d7; font-weight: bold;">if</span> <span style="color: #2d9574;">(</span>&gt; num <span style="color: #67b11d;">(</span>length tlist<span style="color: #67b11d;">)</span><span style="color: #2d9574;">)</span>
      <span style="color: #2d9574;">(</span>message <span style="color: #2d9574;">"The num %d out range of list %s"</span> num tlist<span style="color: #2d9574;">)</span>
    <span style="color: #2d9574;">(</span><span style="color: #4f97d7; font-weight: bold;">if</span> <span style="color: #67b11d;">(</span>= num <span style="color: #a45bad;">1</span><span style="color: #67b11d;">)</span>
        <span style="color: #67b11d;">(</span>car tlist<span style="color: #67b11d;">)</span>
      <span style="color: #67b11d;">(</span><span style="color: #4f97d7; font-weight: bold;">let</span> <span style="color: #b1951d;">(</span><span style="color: #4f97d7;">(</span>num <span style="color: #bc6ec5;">(</span>- num <span style="color: #a45bad;">1</span><span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span>
            <span style="color: #4f97d7;">(</span>tlist <span style="color: #bc6ec5;">(</span>cdr tlist<span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span><span style="color: #b1951d;">)</span>
        <span style="color: #b1951d;">(</span>get-list-element num tlist<span style="color: #b1951d;">)</span>
        <span style="color: #67b11d;">)</span>
      <span style="color: #2d9574;">)</span>
    <span style="color: #bc6ec5;">)</span>
  <span style="color: #4f97d7;">)</span>

<span style="color: #4f97d7;">(</span><span style="color: #4f97d7; font-weight: bold;">setq</span> test <span style="color: #bc6ec5;">(</span>list <span style="color: #a45bad;">9</span> <span style="color: #a45bad;">20</span> <span style="color: #a45bad;">3</span> <span style="color: #a45bad;">49</span><span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span>
<span style="color: #4f97d7;">(</span>prin1 <span style="color: #bc6ec5;">(</span>get-list-element <span style="color: #a45bad;">1</span> test<span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span>
<span style="color: #4f97d7;">(</span>print <span style="color: #bc6ec5;">(</span>get-list-element <span style="color: #a45bad;">2</span> test<span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span>
<span style="color: #4f97d7;">(</span>prin1 <span style="color: #bc6ec5;">(</span>get-list-element <span style="color: #a45bad;">3</span> test<span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span>
<span style="color: #4f97d7;">(</span>print <span style="color: #bc6ec5;">(</span>get-list-element <span style="color: #a45bad;">4</span> test<span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span>
<span style="color: #4f97d7;">(</span>prin1 <span style="color: #bc6ec5;">(</span>get-list-element <span style="color: #a45bad;">5</span> test<span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span>
<span style="color: #4f97d7;">(</span>print <span style="color: #bc6ec5;">(</span>get-list-element <span style="color: #a45bad;">6</span> test<span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span>
</pre>
</div>

<pre class="example">
9
20
3
49
"The num 5 out range of list (9 20 3 49)"
"The num 6 out range of list (9 20 3 49)"

</pre>
<p>
上面函数实现了从列表中取出第 n 个元素的功能，并在超出列表长度是输出提示。通过使用 elisp 提供的函数，我们事实上是可以把列表当数组来用。依惯例，我们用 car 来访问列表的第一个元素，cdr 来访问第二个元素，再往后就没有这样的函数了，可以用 nth 函数来访问：
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4f97d7;">(</span>prin1 <span style="color: #bc6ec5;">(</span>nth <span style="color: #a45bad;">3</span> '<span style="color: #2d9574;">(</span><span style="color: #a45bad;">0</span> <span style="color: #a45bad;">1</span> <span style="color: #a45bad;">2</span> <span style="color: #a45bad;">3</span> <span style="color: #a45bad;">4</span> <span style="color: #a45bad;">5</span><span style="color: #2d9574;">)</span><span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span>
</pre>
</div>

<pre class="example">
3

</pre>
<p>
获得列表一个区间的函数有 nthcdr、last 和 butlast。nthcdr 和 last 比较类似，它们都是返回列表后端的列表。nthcdr 函数返回第 n 个元素后的列表。
last 函数返回倒数 n 个长度的列表。
butlast 和前两个函数不同，返回除了倒数 n 个元素的列表：
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4f97d7;">(</span>prin1 <span style="color: #bc6ec5;">(</span>nthcdr <span style="color: #a45bad;">2</span> '<span style="color: #2d9574;">(</span><span style="color: #a45bad;">0</span> <span style="color: #a45bad;">1</span> <span style="color: #a45bad;">2</span> <span style="color: #a45bad;">3</span> <span style="color: #a45bad;">4</span> <span style="color: #a45bad;">5</span><span style="color: #2d9574;">)</span><span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span>
<span style="color: #4f97d7;">(</span>print <span style="color: #bc6ec5;">(</span>last '<span style="color: #2d9574;">(</span><span style="color: #a45bad;">0</span> <span style="color: #a45bad;">1</span> <span style="color: #a45bad;">2</span> <span style="color: #a45bad;">3</span> <span style="color: #a45bad;">4</span> <span style="color: #a45bad;">5</span><span style="color: #2d9574;">)</span> <span style="color: #a45bad;">2</span><span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span>
<span style="color: #4f97d7;">(</span>prin1 <span style="color: #bc6ec5;">(</span>butlast '<span style="color: #2d9574;">(</span><span style="color: #a45bad;">0</span> <span style="color: #a45bad;">1</span> <span style="color: #a45bad;">2</span> <span style="color: #a45bad;">3</span> <span style="color: #a45bad;">4</span> <span style="color: #a45bad;">5</span><span style="color: #2d9574;">)</span> <span style="color: #a45bad;">2</span><span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span>
</pre>
</div>

<pre class="example">
(2 3 4 5)
(4 5)
(0 1 2 3)

</pre>

<p>
编写一个得到某个区间的列表函数：
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4f97d7;">(</span><span style="color: #4f97d7; font-weight: bold;">defun</span> <span style="color: #bc6ec5; font-weight: bold;">my-subseq</span> <span style="color: #bc6ec5;">(</span>start end seq<span style="color: #bc6ec5;">)</span>
  <span style="color: #bc6ec5;">(</span>butlast <span style="color: #2d9574;">(</span>nthcdr start seq<span style="color: #2d9574;">)</span>
           <span style="color: #2d9574;">(</span>- <span style="color: #67b11d;">(</span>length seq<span style="color: #67b11d;">)</span> end<span style="color: #2d9574;">)</span><span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span>

<span style="color: #4f97d7;">(</span><span style="color: #4f97d7; font-weight: bold;">setq</span> test-list '<span style="color: #bc6ec5;">(</span><span style="color: #a45bad;">0</span> <span style="color: #a45bad;">1</span> <span style="color: #a45bad;">2</span> <span style="color: #a45bad;">3</span> <span style="color: #a45bad;">4</span> <span style="color: #a45bad;">5</span><span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span>
<span style="color: #4f97d7;">(</span>prin1 <span style="color: #bc6ec5;">(</span>my-subseq <span style="color: #a45bad;">2</span> <span style="color: #a45bad;">5</span> test-list<span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span>
<span style="color: #4f97d7;">(</span>print <span style="color: #bc6ec5;">(</span>my-subseq <span style="color: #a45bad;">1</span> <span style="color: #a45bad;">4</span> test-list<span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span>
</pre>
</div>

<pre class="example">
(2 3 4)
(1 2 3)

</pre>
<p>
使用前面这个函数访问列表是没有问题了。但是你也可以想象，链表这种数据结构是不适合随机访问的，代价比较高，如果你的代码中频繁使用这样的函数或者对一个很长列表使用这样的函数，就应该考虑是不是用数组来实现。到目前为止，我们用到的函数都不会修改一个已有的变量。这是函数式编程的一个特点。只用这些函数编写的代码是很容易调试的，因为你不用去考虑一个变量在执行一个代码后就改变了，不用考虑变量的引用情况等等。首先学习怎样修改一个 cons cell 的内容。setcar 和 setcdr 可以修改一个 cons cell 的 CAR 部分和 CDR 部分。
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4f97d7;">(</span><span style="color: #4f97d7; font-weight: bold;">setq</span> foo '<span style="color: #bc6ec5;">(</span>a b c<span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span>
<span style="color: #4f97d7;">(</span>setcar foo 'x<span style="color: #4f97d7;">)</span>
<span style="color: #4f97d7;">(</span>prin1 foo<span style="color: #4f97d7;">)</span>
<span style="color: #4f97d7;">(</span>setcdr foo '<span style="color: #bc6ec5;">(</span>y z<span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span>
<span style="color: #4f97d7;">(</span>print foo<span style="color: #4f97d7;">)</span>
</pre>
</div>

<pre class="example">
(x b c)
(x y z)

</pre>
<p>
思考题
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4f97d7;">(</span><span style="color: #4f97d7; font-weight: bold;">setq</span> foo '<span style="color: #bc6ec5;">(</span>a b c<span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span>
<span style="color: #4f97d7;">(</span>prin1 <span style="color: #bc6ec5;">(</span>setcdr foo foo<span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span>
</pre>
</div>

<pre class="example">
(a . #0)

</pre>
<p>
如何像数组那样修改列表。使用 setcar 和 nthcdr 的组合就可以实现：
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4f97d7;">(</span>prin1 <span style="color: #bc6ec5;">(</span><span style="color: #4f97d7; font-weight: bold;">setq</span> foo '<span style="color: #2d9574;">(</span><span style="color: #a45bad;">1</span> <span style="color: #a45bad;">2</span> <span style="color: #a45bad;">3</span><span style="color: #2d9574;">)</span><span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span>
<span style="color: #4f97d7;">(</span>print <span style="color: #bc6ec5;">(</span>setcar foo 'a<span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span>
<span style="color: #4f97d7;">(</span>prin1 <span style="color: #bc6ec5;">(</span>setcar <span style="color: #2d9574;">(</span>cdr foo<span style="color: #2d9574;">)</span> 'b<span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span>
<span style="color: #4f97d7;">(</span>print <span style="color: #bc6ec5;">(</span>setcar <span style="color: #2d9574;">(</span>nthcdr <span style="color: #a45bad;">2</span> foo<span style="color: #2d9574;">)</span> 'c<span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span>
<span style="color: #4f97d7;">(</span>prin1 foo<span style="color: #4f97d7;">)</span>
</pre>
</div>

<pre class="example">
(1 2 3)
a
b
c
(a b c)

</pre>
<p>
用列表当堆栈用前面提到过可以用 push 向列表头端增加元素，在结合 pop 函数，列表就可以做一个堆栈了。
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4f97d7;">(</span>prin1 <span style="color: #bc6ec5;">(</span><span style="color: #4f97d7; font-weight: bold;">setq</span> foo nil<span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span>
<span style="color: #4f97d7;">(</span>print <span style="color: #bc6ec5;">(</span><span style="color: #4f97d7; font-weight: bold;">push</span> 'a foo<span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span>
<span style="color: #4f97d7;">(</span>prin1 <span style="color: #bc6ec5;">(</span><span style="color: #4f97d7; font-weight: bold;">push</span> 'b foo<span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span>
<span style="color: #4f97d7;">(</span>print <span style="color: #bc6ec5;">(</span><span style="color: #4f97d7; font-weight: bold;">pop</span> foo<span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span>
<span style="color: #4f97d7;">(</span>prin1 foo<span style="color: #4f97d7;">)</span>
</pre>
</div>

<pre class="example">
nil
(a)
(b a)
b
(a)

</pre>
<p>
重排列表如果一直用 push 往列表里添加元素有一个问题是这样得到的列表和加入的顺序是相反的。通常我们需要得到一个反向的列表。reverse 函数可以做到这一点：
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4f97d7;">(</span>prin1 <span style="color: #bc6ec5;">(</span><span style="color: #4f97d7; font-weight: bold;">setq</span> foo '<span style="color: #2d9574;">(</span>a b c<span style="color: #2d9574;">)</span><span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span>
<span style="color: #4f97d7;">(</span>print <span style="color: #bc6ec5;">(</span>reverse foo<span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span>
</pre>
</div>

<pre class="example">
(a b c)
(c b a)

</pre>
</div>
</div>

<div id="outline-container-orgf995c44" class="outline-4">
<h4 id="orgf995c44">数组和序列</h4>
</div>
<div id="outline-container-org4bf2365" class="outline-4">
<h4 id="org4bf2365">符号</h4>
</div>
</div>
<div id="outline-container-org51b604b" class="outline-3">
<h3 id="org51b604b">求值规则</h3>
</div>
<div id="outline-container-orge8da8e3" class="outline-3">
<h3 id="orge8da8e3">变量</h3>
</div>
<div id="outline-container-org97fe0ac" class="outline-3">
<h3 id="org97fe0ac">函数和命令</h3>
</div>
<div id="outline-container-orge274feb" class="outline-3">
<h3 id="orge274feb">正则表达式</h3>
</div>
<div id="outline-container-orge9fb1cd" class="outline-3">
<h3 id="orge9fb1cd">操作对象</h3>
<div class="outline-text-3" id="text-orge9fb1cd">
</div>
<div id="outline-container-orgbaf56eb" class="outline-4">
<h4 id="orgbaf56eb">缓冲区</h4>
</div>
<div id="outline-container-org61d8915" class="outline-4">
<h4 id="org61d8915">窗口</h4>
</div>
<div id="outline-container-orgd05c605" class="outline-4">
<h4 id="orgd05c605">文件</h4>
</div>
<div id="outline-container-orgf62a80d" class="outline-4">
<h4 id="orgf62a80d">文本</h4>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2017-12-12 二 11:44</p>
<p class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 25.3.1 (<a href="http://orgmode.org">Org</a> mode 9.1.3)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
